Revit 2027 API
NumberSystem.JustifyOffset Property
 The offset to the justification curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double JustifyOffset { get; set; }
Public Property JustifyOffset As Double
	Get
	Set
public:
property double JustifyOffset {
	double get ();
	void set (double value);
}
member JustifyOffset : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for justifyOffset must be no more than 30000 feet in absolute value.
See Also
Reference
NumberSystem Class
Autodesk.Revit.DB Namespace